unravel-modules/unravel-completion.el

;;; Enhanced minibuffer commands (consult.el)
(use-package consult
  :ensure t
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :bind
  (:map global-map
        ;; Prot's bindings
        ("M-K" . consult-keep-lines) ; M-S-k is similar to M-S-5 (M-%)
        ("M-F" . consult-focus-lines)   ; same principle
        ("M-s M-b" . consult-buffer)
        ("M-s M-f" . consult-fd)
        ("M-s M-g" . consult-ripgrep)
        ("M-s M-h" . consult-history)
        ("M-s M-i" . consult-imenu)
        ("M-s M-l" . consult-line)
        ("M-s M-m" . consult-mark)
        ("M-s M-y" . consult-yank-pop)
        ("M-s M-s" . consult-outline)
        ;; Overriding defaults: C-x bindings in `ctl-x-map'
        ("C-x M-:" . consult-complex-command) ;; orig. repeat-complex-command
        ("C-x b" . consult-buffer) ;; orig. switch-to-buffer
        ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
        ("C-x 5 b" . consult-buffer-other-frame) ;; orig. switch-to-buffer-other-frame
        ("C-x t b" . consult-buffer-other-tab) ;; orig. switch-to-buffer-other-tab
        ("C-x r b" . consult-bookmark)         ;; orig. bookmark-jump
        ("C-x p b" . consult-project-buffer) ;; orig. project-switch-to-buffer
        ;; Custom M-# bindings for fast register access
        ("M-#" . consult-register-load)
        ("M-'" . consult-register-store) ;; orig. abbrev-prefix-mark (unrelated)
        ("C-M-#" . consult-register)
        ;; Other custom bindings
        ("M-y" . consult-yank-pop) ;; orig. yank-pop
        ;; M-g bindings in `goto-map'
        ("M-g e" . consult-compile-error)
        ("M-g f" . consult-flymake)   ;; Alternative: consult-flycheck
        ("M-g g" . consult-goto-line) ;; orig. goto-line
        ("M-g M-g" . consult-goto-line) ;; orig. goto-line
        ("M-g o" . consult-outline) ;; Alternative: consult-org-heading
        ;; My bindings from my Helm workflow
        ("C-x c i" . consult-imenu)
        ("C-c s" . consult-ripgrep)
        :map consult-narrow-map
        ("?" . consult-narrow-help))
  :config
  (setq consult-line-numbers-widen t)
  ;; (setq completion-in-region-function #'consult-completion-in-region)
  (setq consult-async-min-input 3)
  (setq consult-async-input-debounce 0.5)
  (setq consult-async-input-throttle 0.8)
  (setq consult-narrow-key nil)
  (setq consult-find-args
        (concat "find . -not ( "
                "-path */.git* -prune "
                "-or -path */.cache* -prune )"))
  (setq consult-preview-key 'any)
  (setq consult-project-function nil) ; always work from the current directory (use `cd' to switch directory)

  (add-to-list 'consult-mode-histories '(vc-git-log-edit-mode . log-edit-comment-ring))
  ;; the `imenu' extension is in its own file
  (require 'consult-imenu))
